Revit 2027 API
DefaultDivideSettings.PathMeasurementType Property
 A default Divided Path measurement type for distance layouts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DividedPathMeasurementType PathMeasurementType { get; set; }
Public Property PathMeasurementType As DividedPathMeasurementType
	Get
	Set
public:
property DividedPathMeasurementType PathMeasurementType {
	DividedPathMeasurementType get ();
	void set (DividedPathMeasurementType value);
}
member PathMeasurementType : DividedPathMeasurementType with get, set
Property Value
DividedPathMeasurementType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace